trade_exp/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Контрагенты</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>КПП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НДСПоСтавкам4и2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="498b2f25-6aa5-4645-9e67-8fb628c230a2">
    <name>ПолнаяИнформацияФНС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7bed3672-f007-4c00-b791-0b7ebd647c22">
    <name>ИнформацияФНС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="91d3583a-c05d-459c-9f83-fbfeb62fca07">
    <name>ДатаОбновленияДанныхФНС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9905e69a-09d1-4783-b0d4-a021c2f92565">
    <name>Выручка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>25</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3d17fbf5-4cee-45fc-8af7-13db85700ccc">
    <name>ПлательщикНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="df919cae-c1ba-4fe1-972e-d4222ab0005d">
    <name>КоличествоРаботников</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d0800e2e-b103-41a7-a887-ca049af6677e">
    <name>НалоговыйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b5729a90-7b03-4912-9990-210602af51f1">
    <name>НаименованиеМеждународное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="2629d638-1c9b-4112-b68e-0560bb2d997b">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c62fe487-31b1-4ebb-b1a8-ad1821952696">
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a9a6552a-9493-4353-953b-2f7c777b2f61">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="21ef8fb5-99ad-409e-9d21-398379db456f">
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="72d876b9-29ff-4c5d-bb87-ac07cd9adf4b">
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9ee408c3-a4d4-4570-bc13-b6b4193f889a">
      <name>Страна</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="689cf9d5-3c38-4e84-8e8e-c5bad88bbac8">
      <name>Регион</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="48ac22c5-5bfb-458e-a816-f8ebffd836d8">
      <name>Город</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="7ceb314a-6d3d-4eb9-927d-ec92d5e2ffd3">
      <name>АдресЭП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="055bd074-c785-404d-a8d5-827b2754f483">
      <name>ДоменноеИмяСервера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="7027a1ee-60c1-471c-aee1-a34bdb899465">
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="366f1557-22c4-4832-947b-6020579affac">
      <name>НомерТелефонаБезКодов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="09809d0f-5b0e-46d3-b7b7-24065f75b724">
      <name>ВидДляСписка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fa7aa1c6-abc3-4421-b0ea-7d82a073d157">
      <name>ДействуетС</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="07295009-77c8-4b40-8a9e-62debe0887c6">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="f624df26-f68d-4892-b33d-cf2ef3cdaa0c">
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="987ffccd-246d-49b8-a223-e53d76678887">
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="861931ca-dadf-424e-9e87-cc6fec41bf47">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d3fe16d0-c615-4822-a095-1678933639d4">
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Catalogs/Контрагенты/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура Спр_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)   ///Зад № 65230 запрет редактирования ИНН 
	ЗапретИНН();
	//Заполение Доп.Реквизита ОГРН с ПомошникНового
	Если ЭтаФорма.Параметры.Свойство("ЗаполнятьОГРН") Тогда   
		ДопМодуль.УстановитьЗначениеДополнительногоРеквизитаНаФорме(ЭтаФорма, "огрн", Объект.РегистрационныйНомер );
		ЭтаФорма.Записать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Спр_ВидКонтрагентаПриИзмененииПосле(Элемент)
 ЗапретИНН()
КонецПроцедуры

&НаСервере
Процедура ЗапретИНН()
	
	Если не Объект.Ссылка.Пустая() и НЕ Пользователи.РолиДоступны("ПолныеПрава") и НЕ Пользователи.РолиДоступны("ВводИнформацииПоПартнеруБезКонтроля") Тогда
		ЭтаФорма.Элементы.ИНН.Доступность = Ложь;
		ЭтаФорма.Элементы.ИННФизЛицо.Доступность = Ложь;
		ЭтаФорма.Элементы.ИННИностранногоКонтрагента.Доступность = Ложь;
	Иначе
		ЭтаФорма.Элементы.ИНН.Доступность = Истина;
		ЭтаФорма.Элементы.ИННФизЛицо.Доступность = Истина;
		ЭтаФорма.Элементы.ИННИностранногоКонтрагента.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры	

#Область Данные_FNS
&НаКлиенте
Процедура Док_ЗапроситьСвежиеДанныеПосле(Команда)
	
	Если Объект.ИНН = "" Тогда
		Сообщить("Укажите ИНН контрагента на закладке ""Основное""");
		Возврат;
	КонецЕсли;
	
	Док_ЗапроситьСвежиеДанныеПослеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура Док_ЗапроситьСвежиеДанныеПослеНаСервере()
	
	Попытка 
		Справочники.Контрагенты.ПолучитьДанныеFNS(Объект.Ссылка);
		Сообщить("Данные ФНС обновлены");
	Исключение
        Сообщить(ОписаниеОшибки());                               
	КонецПопытки;
	ПоказатьИнформациюФНС();
	ЭтаФорма.Прочитать();
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьИнформациюФНС()
	
	ДопИнформация = Объект.Ссылка.ИнформацияФНС.Получить();	
	
КонецПроцедуры

&НаКлиенте
Процедура Док_СтраницыФормыПриСменеСтраницыПосле(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "СтраницаДополнительнаяИнформация" Тогда
		ПоказатьИнформациюФНС();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ПолнаяИнформацияПосле(Команда)
		
	ПолнаяИнформацияФНС = Док_ПолнаяИнформацияПослеСервер();
	Если ПолнаяИнформацияФНС = Неопределено Тогда
		Сообщить("Нет данных по контрагенту");
	Иначе
		ПолнаяИнформацияФНС.Показать("Полная информация");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция Док_ПолнаяИнформацияПослеСервер()
	
	ПолнаяИнформацияФНС = Объект.Ссылка.ПолнаяИнформацияФНС.Получить();		
	Возврат ПолнаяИнформацияФНС;
	
КонецФункции	

&НаСервере
Процедура Док_ПриЧтенииНаСервереПосле(ТекущийОбъект)
Если Не Объект.Ссылка.Пустая() тогда
	Если Не Пользователи.РолиДоступны("РазрешениеМенятьПартнераВКонтрагенте") тогда
		ЭтаФорма.Элементы.Партнер.ТолькоПросмотр=Истина;
	КонецЕсли;	
КонецЕсли;	
КонецПроцедуры

#КонецОбласти
